products/admin/fedexwsdl/RateRequest_Intra_India_COD_and_DIA.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v13">
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key></Key>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
          <AccountNumber></AccountNumber>
            <MeterNumber></MeterNumber>
      
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC21_USUS_E20011_Serpk_Curr+_POS</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>13</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2012-01-05T09:30:47-05:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>STANDARD_OVERNIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>LB</Units>
               <Value>50.0</Value>
            </TotalWeight>
            <Shipper>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <CompanyName>FedEx-WAPI</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Test Sender Address Line1</StreetLines>
                  <City>NEW DELHI</City>
                  <StateOrProvinceCode>DL</StateOrProvinceCode>
                  <PostalCode>110010</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <PersonName>Recipient Contact</PersonName>
                  <PhoneNumber>1234567890</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Recipient Address Line1</StreetLines>
                  <City>PUNE</City>
                  <StateOrProvinceCode>MH</StateOrProvinceCode>
                  <PostalCode>411011</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>150067600</AccountNumber>
                     <Tins>
                        <TinType>BUSINESS_STATE</TinType>
                        <Number>123456</Number>
                     </Tins>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <SpecialServicesRequested>
               <SpecialServiceTypes>COD</SpecialServiceTypes>
               <SpecialServiceTypes>DELIVERY_ON_INVOICE_ACCEPTANCE</SpecialServiceTypes>
               <CodDetail>
                  <CodCollectionAmount>
                     <Currency>INR</Currency>
                     <Amount>100.00</Amount>
                  </CodCollectionAmount>
                  <CollectionType>CASH</CollectionType>
                  <FinancialInstitutionContactAndAddress>
                     <Contact>
                        <PersonName>Radhika</PersonName>
                        <CompanyName>SYNTEL</CompanyName>
                        <PhoneNumber>9922184679</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Recipient Address Line1</StreetLines>
                        <City>NEWDELHI</City>
                        <StateOrProvinceCode>DL</StateOrProvinceCode>
                        <PostalCode>110010</PostalCode>
                        <CountryCode>IN</CountryCode>
                     </Address>
                  </FinancialInstitutionContactAndAddress>
                  <RemitToName>Sachin</RemitToName>
               </CodDetail>
               <DeliveryOnInvoiceAcceptanceDetail>
                  <Recipient>
                     <AccountNumber>150067600</AccountNumber>
                     <Contact>
                        <PersonName>RECIPIENT</PersonName>
                        <CompanyName>KCORP</CompanyName>
                        <PhoneNumber>9412491533</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Recipient Address Line1</StreetLines>
                        <City>NEWDELHI</City>
                        <StateOrProvinceCode>DL</StateOrProvinceCode>
                        <PostalCode>110010</PostalCode>
                        <CountryCode>IN</CountryCode>
                     </Address>
                  </Recipient>
               </DeliveryOnInvoiceAcceptanceDetail>
            </SpecialServicesRequested>
              
            <CustomsClearanceDetail>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>756942735</AccountNumber>
                        <Tins>
                           <TinType>PERSONAL_STATE</TinType>
                           <Number>1057</Number>
                           <Usage>ShipperTinsUsage</Usage>
                        </Tins>
                        <Contact>
                           <ContactId>RBB1057</ContactId>
                           <PersonName>ALPHA AND BRAVO BUILDINGS</PersonName>
                           <Title>abc</Title>
                           <CompanyName>Fedex</CompanyName>
                           <PhoneNumber>9762308621</PhoneNumber>
                           <PhoneExtension>02033469</PhoneExtension>
                           <PagerNumber>9762308621</PagerNumber>
                           <FaxNumber>9762308621</FaxNumber>
                           <EMailAddress>Radhika_Margam@syntelinc.com</EMailAddress>
                        </Contact>
                        <Address>
                           <StreetLines>Test Sender Address Line1</StreetLines>
                           <City>PUNE</City>
                           <StateOrProvinceCode>MH</StateOrProvinceCode>
                           <PostalCode>411011</PostalCode>
                           <CountryCode>IN</CountryCode>
                        </Address>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>NON_DOCUMENTS</DocumentContent>
               <CustomsValue>
                  <Currency>INR</Currency>
                  <Amount>100.000000</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <Purpose>SOLD</Purpose>
               </CommercialInvoice>
               <Commodities>
                  <Name>String</Name>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>ABCD</Description>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>10.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>EA</QuantityUnits>
                  <UnitPrice>
                     <Currency>INR</Currency>
                     <Amount>1.000000</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>INR</Currency>
                     <Amount>100.000000</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>
            <RateRequestTypes>ACCOUNT</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
               <ContentRecords>
                  <PartNumber>123445</PartNumber>
                  <ItemNumber>kjdjalsro1262739827</ItemNumber>
                  <ReceivedQuantity>12</ReceivedQuantity>
                  <Description>ContentDescription</Description>
               </ContentRecords>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>